app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC
---
  def index
    @posts = Post.all.reverse_order

INSERT INTO "posts" ("created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?)  [["created_at", "2022-08-01 18:33:12.814145"], ["updated_at", "2022-08-01 18:33:12.814145"], ["title", nil], ["body", nil]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save